app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def current_user
      if decoded_token
          user_id = decoded_token['user_id']
          @user = User.find_by(id: user_id)