app/controllers/auth_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
    def create

      @user = User.create(user_params)

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "martin"], ["LIMIT", 1]]
---
    def login
      @user = User.find_by(username: params[:user][:username])