app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE "expenses"."user_id" = ?  [["user_id", 9]]
---
    def show
        @expense = @user.expense.find_by(id: params[:id])

INSERT INTO "expenses" ("name", "amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "romantic getaway"], ["amount", 10000], ["user_id", 1], ["created_at", "2021-04-13 21:18:17.764871"], ["updated_at", "2021-04-13 21:18:17.764871"]]
---
    def create
        @user = User.find_or_create_by(user_params)
        @expense = user.expenses.build(expenses_params)
       if @user.valid? && @expense.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
    def find_user
        @user = User.find_by(id: params[:user_id])