app/controllers/users_controller.rb

    def create
      @user = User.create(users_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)

    def update
      #  byebug
      @user = User.find_by(id: params[:id])
       @user.update(users_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "users" SET "income" = ?, "budget" = ?, "yearly" = ?, "monthly" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["income", 100], ["budget", 10], ["yearly", 1], ["monthly", 0], ["updated_at", "2021-04-09 15:18:27.987764"], ["id", 4]]

    def destroy
      @user = User.find_by_id(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]